{"status":"success","totalResults":96,"results":[{"title":"Steve Hanke: 'We know the price of bitcoin, but not its value ... it's probably zero'","link":"https://uk.finance.yahoo.com/news/steve-hanke-bitcoin-price-value-is-zero-000106264.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 00:01:06","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2021-12/b6fa6940-633a-11ec-bdbf-3a5a3cc18b93","source_id":"yahoo"},{"title":"Steve Hanke: 'We know the price of bitcoin, but not its value ... it's probably zero'","link":"https://uk.finance.yahoo.com/news/steve-hanke-bitcoin-price-value-is-zero-000106264.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 00:01:06","image_url":"https://s.yimg.com/os/creatr-uploaded-images/2021-12/b6fa6940-633a-11ec-bdbf-3a5a3cc18b93","source_id":"yahoo_sg"},{"title":"What is the value of Bitcoin?","link":"https://uk.finance.yahoo.com/video/value-bitcoin-000100947.html","keywords":null,"creator":null,"video_url":null,"description":null,"content":null,"pubDate":"2021-12-23 00:01:00","image_url":"https://s.yimg.com/hd/cp-video-transcode/prod/2021-12/21/61c18ebfa9d56a2e7ff466f2/61c18ebfa9d56a2e7ff466f3_o_U_v2.jpg","source_id":"yahoo"},{"title":"Boomers Rejoice: RadioShack is Making Crypto for Old People","link":"https://futurism.com/radioshack-crypto","keywords":["Future Society","blockchain","crypto","cryptocurrency","the digest"],"creator":["Noor Al-Sibai"],"video_url":null,"description":"Crypto for the Rest of Us After an extremely sad online-only relaunch, RadioShack is gasping for relevancy by launching a cryptocurrency exchange for the grown and sexy. The husk of what was once known lovingly as “The Shack” announced this week its new decentralized finance (DeFi) exchange called RADIO with bespoke tokens of the same […]","content":"Crypto for the Rest of Us After an extremely sad online-only relaunch, RadioShack is gasping for relevancy by launching a cryptocurrency exchange for customers who, in the company’s own words, are on average “age 68.” The husk of what was once known lovingly as “The Shack” announced this week that it’s creating a new decentralized finance (DeFi) exchange called RADIO, with bespoke tokens of the same name. They say it’s going to — get this, folks — make crypto go mainstream. “RadioShack, and RadioShack alone, can bridge the gap and ‘cross the chasm’ of mainstream usage for cryptocurrency,” the company boasted, invoking the braggadocio of 80s nerds with a brand-new Tandy “Too many [cryptocurrency companies] focused on speculation and not enough on making the ‘old-school’ customer feel comfortable.” Bitcoin Youth The thing keeping crypto from becoming widely-accepted and used currency is, according to RadioShack, that decision-makers don’t trust it — and those movers and shakers are generally older than the “average crypto buyer” in their 20s or 30s. It’s not a terrible argument on its face — traditional business types aren’t exactly gunning to shovel their wealth into the voraciously deregulated crypto system. But the fact that it’s RadioShack, a company most people presumed died at least a decade ago, makes this feel like comeback tour no one asked for. Unfortunately, we do again have to hand it to the good ole ‘Shack in the wording of this announcement, which sounds every bit like it was written by and for a boomer uncle. “The older generation simply doesn’t trust the new-fangled ideas of the Bitcoin youth,” the statement reads. Yes, seriously, it really says that, and goes on to add that “RadioShack is perfect” [emphasis theirs’] as the leader of the charge to get rich old people to invest in the blockchain. If nothing else, this longshot bid is an extremely crypto wager to make. READ MORE: Zombie brand RadioShack is launching a crypto market for ‘the older generation’ [The Verge] More terrible crypto adoption: The Staples Center Will Be Renamed the “Crypto.com Arena” Because We Are Condemned to Eternal Damnation The post Boomers Rejoice: RadioShack is Making Crypto for Old People appeared first on Futurism.","pubDate":"2021-12-22 23:03:01","full_description":null,"image_url":null,"source_id":"futurism"},{"title":"Grayscale Bitcoin Trust (GBTC) Cryptocurrency Fund Investor Overview Q3 2021","link":"https://www.prnewswire.com:443/news-releases/grayscale-bitcoin-trust-gbtc-cryptocurrency-fund-investor-overview-q3-2021-301449889.html","keywords":["Publishing & Information Services","Banking & Financial Services","Cryptocurrency","PUB","ICO","FIN"],"creator":null,"video_url":null,"description":"DUBLIN, Dec. 22, 2021 /PRNewswire/ -- The \"Grayscale Bitcoin Trust (GBTC) Cryptocurrency Fund: Institutional Investment 2021 Q3\" report has been added to ResearchAndMarkets.com's offering. Investor interest in Bitcoin and other cryptocurrencies surged in 2021. This report looks at...","content":null,"pubDate":"2021-12-22 22:30:00","full_description":null,"image_url":"https://mma.prnewswire.com/media/539438/Research_and_Markets_Logo.jpg?p=publish","source_id":"cision"},{"title":"Stratos Jet Charters Reveals Crypto Payment Acceptance for Flights via FTX Pay","link":"https://news.bitcoin.com/stratos-jet-charters-reveals-crypto-payment-acceptance-for-flights-via-ftx-pay/","keywords":["News","aviation","Bitcoin","BitPay","Brett Harrison","Crypto","crypto assets","crypto partner","crypto payments","Cryptocurrencies","Digital Assets","Digital Currency Payments","Fast Private Jet","ftx","FTX Pay","FTX.US","Joel Thomas","Paying With Crypto","Private Jets","Privatefly","Stratos Jet","Stratos Jet CEO","Stratos Marketplace"],"creator":["Jamie Redman"],"video_url":null,"description":"The Orlando, Florida-based Stratos Jet Charters Inc. has announced the company has partnered with FTX US and the collaboration will make it so Stratos Jet customers can pay for services with crypto payments via FTX Pay. The CEO of Stratos Jet says the company has been in search of a crypto partner and noted that […]","content":"The Orlando, Florida-based Stratos Jet Charters Inc. has announced the company has partnered with FTX US and the collaboration will make it so Stratos Jet customers can pay for services with crypto payments via FTX Pay. The CEO of Stratos Jet says the company has been in search of a crypto partner and noted that FTX was an “ideal fit.” Stratos Jet Customers Can Book and Pay for Flights Using Cryptocurrencies On Tuesday, the firm Stratos Jet Charters Inc. revealed the company has inked a deal with the crypto firm FTX US and will allow customers to pay with cryptocurrencies. The firm is a private jet charter broker and it offers a platform called the Stratos Marketplace for desktop and mobile devices. The application lets people book flights with Stratos Jet instantly and with the FTX integration, the company says with “just a few extra clicks, clients can also easily book and pay for their charter flights.” Stratos Jet CEO Joel Thomas explained during the announcement that the company was looking for a crypto partner to work with Stratos Marketplace. Thomas said the myriad of features and security FTX offers led the firm to choose the crypto company. In a statement sent to Bitcoin.com News, Thomas elaborated that the “[FTX] platform is sophisticated yet simple for clients to use, and it integrates seamlessly with our air charter marketplace.” Stratos Jet is not the only private jet charter that offers customers the ability to pay in cryptocurrencies. In mid-February, Bitcoin.com News reported on the company directional aviation company Privatefly’s report, which said close to 20% of the firm’s sales were paid in cryptocurrencies in January. People can also leverage the company Fast Private Jet with the crypto payments firm Bitpay. In regard to the Stratos Jet partnership, the president of FTX US, Brett Harrison, says that FTX pay was built to make it so firms can “accept payment in any type of currency.” “As an organization, Stratos prioritizes the customer experience and we’re happy to assist them in this process through our payment platform,” Harrison further remarked. “It’s exciting to work with an industry leader and assist in bettering their customer experience while also elevating the presence of digital assets outside of the traditional financial landscape.” The Stratos Jet CEO concluded by explaining that there’s been an “unprecedented level of demand for private aviation.” The firm’s executive felt that by leveraging FTX it would “dramatically reduce our risk vs credit cards.” FTX’s collaboration with Stratos Jet follows the firm’s deal with Monumental Sports Entertainment and a number of sports-related partnerships in 2021. What do you think about Stratos Jet accepting digital currencies via FTX Pay? Let us know what you think about this subject in the comments section below.","pubDate":"2021-12-22 21:00:11","full_description":"Stratos Jet Charters Reveals Crypto Payment Acceptance for Flights via FTX Pay The Orlando, Florida-based Stratos Jet Charters Inc. has announced the company has partnered with FTX US and the collaboration will make it so Stratos Jet customers can pay for services with crypto payments via FTX Pay. The CEO of Stratos Jet says the company has been in search of a crypto partner and noted that FTX was an “ideal fit.” Stratos Jet Customers Can Book and Pay for Flights Using Cryptocurrencies On Tuesday, the firm Stratos Jet Charters Inc. revealed the company has inked a deal with the crypto firm FTX US and will allow customers to pay with cryptocurrencies. The firm is a private jet charter broker and it offers a platform called the Stratos Marketplace for desktop and mobile devices. The application lets people book flights with Stratos Jet instantly and with the FTX integration, the company says with “just a few extra clicks, clients can also easily book and pay for their charter flights.” Stratos Jet CEO Joel Thomas explained during the announcement that the company was looking for a crypto partner to work with Stratos Marketplace. Thomas said the myriad of features and security FTX offers led the firm to choose the crypto company. In a statement sent to Bitcoin.com News, Thomas elaborated that the “[FTX] platform is sophisticated yet simple for clients to use, and it integrates seamlessly with our air charter marketplace.” Stratos Jet is not the only private jet charter that offers customers the ability to pay in cryptocurrencies. In mid-February, Bitcoin.com News reported on the company directional aviation company Privatefly’s report, which said close to 20% of the firm’s sales were paid in cryptocurrencies in January. People can also leverage the company Fast Private Jet with the crypto payments firm Bitpay. In regard to the Stratos Jet partnership, the president of FTX US, Brett Harrison, says that FTX pay was built to make it so firms can “accept payment in any type of currency.” “As an organization, Stratos prioritizes the customer experience and we’re happy to assist them in this process through our payment platform,” Harrison further remarked. “It’s exciting to work with an industry leader and assist in bettering their customer experience while also elevating the presence of digital assets outside of the traditional financial landscape.” The Stratos Jet CEO concluded by explaining that there’s been an “unprecedented level of demand for private aviation.” The firm’s executive felt that by leveraging FTX it would “dramatically reduce our risk vs credit cards.” FTX’s collaboration with Stratos Jet follows the firm’s deal with Monumental Sports Entertainment and a number of sports-related partnerships in 2021. Tags in this story aviation , Bitcoin , BitPay , Brett Harrison , Crypto , crypto assets , crypto partner , crypto payments , Cryptocurrencies , Digital Assets , Digital Currency Payments , Fast Private Jet , ftx , FTX Pay , FTX.US , Joel Thomas , Paying With Crypto , Private Jets , Privatefly , Stratos Jet , Stratos Jet CEO , Stratos Marketplace What do you think about Stratos Jet accepting digital currencies via FTX Pay? Let us know what you think about this subject in the comments section below. Jamie Redman Jamie Redman is the News Lead at Bitcoin.com News and a financial tech journalist living in Florida. Redman has been an active member of the cryptocurrency community since 2011. He has a passion for Bitcoin, open-source code, and decentralized applications. Since September 2015, Redman has written more than 4,900 articles for Bitcoin.com News about the disruptive protocols emerging today. China’s Xinhua News Agency to Issue NFTs Despite Crackdown on Crypto NEWS | 6 hours ago Game Developers GSC Game World and Ubisoft Face Backlash About NFT Inclusion NEWS | 10 hours ago Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Turkish Lira Slump Contributes to Rise in Turkey’s Daily Crypto Trades to Over One Million Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Robinhood Launches Cryptocurrency Gifts Program Trading platform Robinhood is launching a cryptocurrency gifts program, allowing users to gift several cryptocurrencies, including bitcoin, dogecoin, ether, bitcoin cash, and litecoin. As with crypto trading, gifts are commission free and users can gift as little as $1 in ... read more. USDC Sees Native Launch on Avalanche Illegal Crypto Miners Threatened With Jail Time in Russia Value Locked in Defi Continues to Slide, ETH Defi Dominates by 65%, Solana Transactions Reign Polygon, Reddit Co-Founder's VC Firm Launch $200 Million Social Media Web3 Fund","image_url":null,"source_id":"bitcoin"},{"title":"Turkish Lira Slump Contributes to Rise in Turkey’s Daily Crypto Trades to Over One Million","link":"https://news.bitcoin.com/turkish-lira-slump-contributes-to-rise-in-turkeys-daily-crypto-trades-to-over-one-million/","keywords":["Economics","Bitcoin","bitcoin all time highs","Central Bank of the Republic of Turkey","cryptocurrency trades","gold restrictions","Recep Tayyip Erdoğan","Stablecoins","Turkey inflation","Turkish Lira"],"creator":["Terence Zimwara"],"video_url":null,"description":"The popularity of cryptocurrencies in economically embattled Turkey has continued to surge with the number of daily trades now surpassing one million, a report has said. This surge in trades has been attributed to the depreciating lira which plunged to a new low against the USD on December 20. Lira Plunges Cryptocurrency trades in inflation-stricken […]","content":"The popularity of cryptocurrencies in economically embattled Turkey has continued to surge with the number of daily trades now surpassing one million, a report has said. This surge in trades has been attributed to the depreciating lira which plunged to a new low against the USD on December 20. Lira Plunges Cryptocurrency trades in inflation-stricken Turkey have surged to above one million per day for the first time since March, a Reuters report citing Chainalysis and Kaiko data has said. According to the report, the return to over a million trades per day has come at a time when Turkey’s fiat currency, the lira, has depreciated by almost 40% since September. Prior to the latest surge, cryptocurrency trades in Turkey had previously surpassed the one million per day mark after President Recep Tayyip Erdogan’s unexpected dismissal of the central bank governor on March 22. The dismissal of then-governor Naci Agbal sparked inflation fears among Turks and caused the lira to plunge by more than 10%. However, after a period of relative stability — which in turn led to reduced cryptocurrency transactions — trades per day went above the one million mark again after the lira’s latest plunge. As shown by recent data, the lira briefly plunged to a new low of 18.10 for every dollar on December 20, 2021. However, after the government announced a rescue plan, the lira has recovered to 12.50 at the time of writing. Gold Restrictions a Boon for Crypto The Reuters report suggested the latest increase in cryptocurrency trades may be linked to restrictions imposed during the year that have made it difficult for Turks to convert the lira to gold. Bitcoin’s race to a new all-time high of more than $69K in November is also said to have contributed to the surge in trades. In terms of the cryptocurrencies preferred by Turks, the report said bitcoin and the stablecoin USDT are the most widely used coins. This is evidenced by data showing that the TRY/USDT pair is one of the most traded pairs while the fiat currency’s pair with BTC is the 12th most traded. Reports that Turks are increasingly switching to cryptocurrencies come a few months after the central bank prohibited the use of crypto assets when paying for goods and services. In addition, President Erdogan has said the country is at war with cryptocurrencies. What are your thoughts on this story? Tell us what you think in the comments section below.","pubDate":"2021-12-22 19:00:05","full_description":"Turkish Lira Slump Contributes to Rise in Turkey's Daily Crypto Trades to Over One Million The popularity of cryptocurrencies in economically embattled Turkey has continued to surge with the number of daily trades now surpassing one million, a report has said. This surge in trades has been attributed to the depreciating lira which plunged to a new low against the USD on December 20. Lira Plunges Cryptocurrency trades in inflation-stricken Turkey have surged to above one million per day for the first time since March, a Reuters report citing Chainalysis and Kaiko data has said. According to the report , the return to over a million trades per day has come at a time when Turkey’s fiat currency, the lira, has depreciated by almost 40% since September. Prior to the latest surge, cryptocurrency trades in Turkey had previously surpassed the one million per day mark after President Recep Tayyip Erdogan’s unexpected dismissal of the central bank governor on March 22. The dismissal of then-governor Naci Agbal sparked inflation fears among Turks and caused the lira to plunge by more than 10%. However, after a period of relative stability — which in turn led to reduced cryptocurrency transactions — trades per day went above the one million mark again after the lira’s latest plunge. As shown by recent data , the lira briefly plunged to a new low of 18.10 for every dollar on December 20, 2021. However, after the government announced a rescue plan, the lira has recovered to 12.50 at the time of writing. Gold Restrictions a Boon for Crypto The Reuters report suggested the latest increase in cryptocurrency trades may be linked to restrictions imposed during the year that have made it difficult for Turks to convert the lira to gold. Bitcoin’s race to a new all-time high of more than $69K in November is also said to have contributed to the surge in trades. In terms of the cryptocurrencies preferred by Turks, the report said bitcoin and the stablecoin USDT are the most widely used coins. This is evidenced by data showing that the TRY/ USDT pair is one of the most traded pairs while the fiat currency’s pair with BTC is the 12th most traded. Reports that Turks are increasingly switching to cryptocurrencies come a few months after the central bank prohibited the use of crypto assets when paying for goods and services. In addition, President Erdogan has said the country is at war with cryptocurrencies. Tags in this story Bitcoin , bitcoin all time highs , Central Bank of the Republic of Turkey , cryptocurrency trades , gold restrictions , Recep Tayyip Erdoğan , Stablecoins , Turkey inflation , Turkish Lira What are your thoughts on this story? Tell us what you think in the comments section below. Terence Zimwara Terence Zimwara is a Zimbabwe award-winning journalist, author and writer. He has written extensively about the economic troubles of some African countries as well as how digital currencies can provide Africans with an escape route. Global Markets, Bitcoin Defy Expectations After Fed's Hawkish Taper Plan Announcement ECONOMICS | 6 days ago Economist Mohamed El-Erian Says Fed’s Characterization of Inflation as ‘Transitory’ the ‘Worst Call in History’ ECONOMICS | Dec 13, 2021 Image Credits : Shutterstock, Pixabay, Wiki Commons Previous article Fact Checking Media Tries to Debunk Great Reset Theories, Articles Ignite Heated Discussions Over Reboot Agenda Disclaimer : This article is for informational purposes only. It is not a direct offer or solicitation of an offer to buy or sell, or a recommendation or endorsement of any products, services, or companies. Bitcoin.com does not provide investment, tax, legal, or accounting advice. Neither the company nor the author is responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods or services mentioned in this article. Read disclaimer Show comments More Popular News In Case You Missed It Robinhood Launches Cryptocurrency Gifts Program Trading platform Robinhood is launching a cryptocurrency gifts program, allowing users to gift several cryptocurrencies, including bitcoin, dogecoin, ether, bitcoin cash, and litecoin. As with crypto trading, gifts are commission free and users can gift as little as $1 in ... read more. USDC Sees Native Launch on Avalanche Illegal Crypto Miners Threatened With Jail Time in Russia Indian Crypto Exchange Says 82% of Users Earn Profits This Year, Trading Volume Soars 1,735% Russia to Decide Between Full Ban and Legalization of Crypto Investments, Trade","image_url":null,"source_id":"bitcoin"},{"title":"I might be sitting on a Bitcoin fortune of $36MILLION as my computer sits untouched in storage – but I can’t access it","link":"https://www.thesun.ie/money/8107925/sitting-on-bitcoin-fortune/","keywords":["Money","News Money","Bitcoin"],"creator":["Jemma Carr"],"video_url":null,"description":"A CRYPTOCURRENCY trader thinks he could have $36million in Bitcoin after his PC sat in storage for 11 years – but he doesn’t know how to access it. The anonymous Reddit user posted his conundrum on the Bitcoin subreddit, asking if anyone had any advice on how he can get his hands on the fortune. The user said […]","content":"A CRYPTOCURRENCY trader thinks he could have $36million in Bitcoin after his PC sat in storage for 11 years – but he doesn’t know how to access it. The anonymous Reddit user posted his conundrum on the Bitcoin subreddit, asking if anyone had any advice on how he can get his hands on the fortune. GettyA cryptocurrency trader thinks he could have $36million in Bitcoin after his PC sat in storage for 11 years[/caption] Getty Images - GettyThe anonymous Reddit user posted his conundrum on the Bitcoin subreddit[/caption] The user said he started mining bitcoin for weeks on end in 2009 – before leaving his laptop in storage when he moved overseas. Now, 11 years later, he is set to be reunited with his old computer – and hopes to regain access to his Bitcoin collection as soon as possible. He took to Reddit to ask for help, with one eager tech guru speculating his hoard could now be worth a massive $36million. The Bitcoin hoarder wrote: “In 2009 I was really interested in anything related to economics and specifically currency. “I came across the whitepaper for Bitcoin and, after doing some reading, I decided to download the bitcoin client. “I remember I was mining for weeks on end not really knowing the significance of what I was doing but was just really trying to support the idea of a virtual currency as I knew this could be the future. Most read in The Irish Sun SHOCK DEATH Il Divo star's cause of death revealed as he suddenly passes away age 53 MAX-IMUM THREAT Verstappen will quit F1 if he loses engineer who helped him beat Hamilton MISSING PAIR Sisters, aged 5 and 3, missing from their home as police issue urgent appeal COVID CATCH Muireann O'Connell 'heartbroken' at positive Covid test just before Christmas RYLED UP Rylan Clark reveals bitter feud with top actor & wanted to 'punch him in the face' LANDLORD ABOVE I rented my property to tenants from HELL & I think I should call Gardai “Around 2010 I threw my computer and all my furniture in storage and moved overseas. “My computer has been sitting in storage for about 11 years now and I am going back soon to open it up and see if I still have the bitcoin client. “I am not really in sync with how Bitcoin operates nowadays. “All I know is you either have your private keys in cold storage or hot storage. “I think in 2009 my computer should hold the private keys on cold storage as there weren’t any virtual wallets back then. “When I go back soon, I will attempt to recover my potential riches or perhaps cry in despair.” One Bitcoin enthusiast was quick to speculate that he has amassed 1,000 Bitcoin – worth a total of $36million – if he truly “mined for weeks with a powerful PC”. The anonymous user warned him about scammers who could seek to con him out of his riches. Another added: “If you ask someone to restore your formatted drive, tell them it has important personal files. “Don’t tell them it has Bitcoin from 2009.” Another urged him to pick a “pro” computer technician to access the hard drive, adding: “Don’t tell them what is there. “Maybe even pay extra to be there when they do it? If there is few million it will be tempting to steal it and tell you nothing was recovered.” Bitcoin trading, while tempting, is highly risky and is not a guaranteed way to make money. It has had wild price fluctuations in recent months and the price can change on an almost hourly basis. The price of a Bitcoin was at $40,258 on January 9, according to Coindesk, but fell to $34,214 just three days later. Similarly, the price of Bitcoin soared by more than 21% earlier this month – so it can be hard for a shopper to get an accurate idea of the price of an item if its value changes on a daily basis. Should the Reddit user’s recovery effort fail, it wouldn’t be the first time someone lost over six figures in Bitcoin. Earlier this year, one man lost £275 million in Bitcoin after tossing out his hard drive. One trader lost out on $2 million in Bitcoin when his crypto password was stolen last month. The world’s richest Bitcoin trader lost $5 billion in one month after the Crypto bubble burst last month. The risks of buying with cryptocurrencies Investing and making a purchase in cryptocurrencies such as Bitcoin is risky: Their value is highly volatile and City watchdog the Financial Conduct Authority has warned investors should be prepared to lose all their money. Investing in cryptocurrencies is not a guaranteed way to make money. You should also think carefully about making purchases with a cryptocurrency. For example, Bitcoin has had wild price fluctuations in recent months and the price can change on an almost hourly basis. The price of a Bitcoin was at $40,258 on January 9, according to Coindesk, but fell to $34,214 just three days later. That’s a 15% drop. These price swings are risky for a business as you could sell an item for a Bitcoin at one price and the value may drop soon after, leaving you with less money from a sale. Similarly, the price of Bitcoin soared by more than 21% earlier this month – so it can be hard for a shopper to get an accurate idea of the price of an item if its value changes on a daily basis. GettyThe user started mining bitcoin for weeks on end in 2009[/caption]","pubDate":"2021-12-22 18:49:57","full_description":"A CRYPTOCURRENCY trader thinks he could have $36million in Bitcoin after his PC sat in storage for 11 years - but he doesn't know how to access it. The anonymous Reddit user posted his conundrum on the Bitcoin subreddit, asking if anyone had any advice on how he can get his hands on the fortune. The user said he started mining bitcoin for weeks on end in 2009 - before leaving his laptop in storage when he moved overseas. Now, 11 years later, he is set to be reunited with his old computer - and hopes to regain access to his Bitcoin collection as soon as possible. He took to Reddit to ask for help, with one eager tech guru speculating his hoard could now be worth a massive $36million. The Bitcoin hoarder wrote: \"In 2009 I was really interested in anything related to economics and specifically currency. \"I came across the whitepaper for Bitcoin and, after doing some reading, I decided to download the bitcoin client. \"I remember I was mining for weeks on end not really knowing the significance of what I was doing but was just really trying to support the idea of a virtual currency as I knew this could be the future. \"Around 2010 I threw my computer and all my furniture in storage and moved overseas. \"My computer has been sitting in storage for about 11 years now and I am going back soon to open it up and see if I still have the bitcoin client. \"I am not really in sync with how Bitcoin operates nowadays. \"All I know is you either have your private keys in cold storage or hot storage. \"I think in 2009 my computer should hold the private keys on cold storage as there weren't any virtual wallets back then. \"When I go back soon, I will attempt to recover my potential riches or perhaps cry in despair.\" One Bitcoin enthusiast was quick to speculate that he has amassed 1,000 Bitcoin - worth a total of $36million - if he truly \"mined for weeks with a powerful PC\". The anonymous user warned him about scammers who could seek to con him out of his riches. Another added: \"If you ask someone to restore your formatted drive, tell them it has important personal files. \"Don't tell them it has Bitcoin from 2009.\" Another urged him to pick a \"pro\" computer technician to access the hard drive, adding: \"Don't tell them what is there. \"Maybe even pay extra to be there when they do it? If there is few million it will be tempting to steal it and tell you nothing was recovered.\" Bitcoin trading, while tempting, is highly risky and is not a guaranteed way to make money. It has had wild price fluctuations in recent months and the price can change on an almost hourly basis. The price of a Bitcoin was at $40,258 on January 9, according to Coindesk, but fell to $34,214 just three days later. Similarly, the price of Bitcoin soared by more than 21% earlier this month - so it can be hard for a shopper to get an accurate idea of the price of an item if its value changes on a daily basis. Should the Reddit user's recovery effort fail, it wouldn't be the first time someone lost over six figures in Bitcoin. Earlier this year, one man lost £275 million in Bitcoin after tossing out his hard drive. One trader lost out on $2 million in Bitcoin when his crypto password was stolen last month. The world's richest Bitcoin trader lost $5 billion in one month after the Crypto bubble burst last month. Investing and making a purchase in cryptocurrencies such as Bitcoin is risky: Their value is highly volatile and City watchdog the Financial Conduct Authority has warned investors should be prepared to lose all their money. Investing in cryptocurrencies is not a guaranteed way to make money. You should also think carefully about making purchases with a cryptocurrency. For example, Bitcoin has had wild price fluctuations in recent months and the price can change on an almost hourly basis. The price of a Bitcoin was at $40,258 on January 9, according to Coindesk, but fell to $34,214 just three days later. That's a 15% drop. These price swings are risky for a business as you could sell an item for a Bitcoin at one price and the value may drop soon after, leaving you with less money from a sale. Similarly, the price of Bitcoin soared by more than 21% earlier this month - so it can be hard for a shopper to get an accurate idea of the price of an item if its value changes on a daily basis.","image_url":null,"source_id":"thesun_ie"},{"title":"Meme Stock GameStop Now Accepts Meme Cryptos Like Doge","link":"https://www.kotaku.com.au/2021/12/meme-stock-gamestop-now-accepts-meme-cryptos-like-doge/","keywords":["Computing","articles","decentralization","doge","dogecoin","funko","gamestop","internet culture","internet memes","meme","meme stock","reddit","robinhood","technology"],"creator":["Ethan Gach"],"video_url":null,"description":"In a year which began with memes helping to propel GameStop’s junk stock price into the stratosphere, it’s only fitting... The post Meme Stock GameStop Now Accepts Meme Cryptos Like Doge appeared first on Kotaku Australia.","content":"In a year which began with memes helping to propel GameStop’s junk stock price into the stratosphere, it’s only fitting that the shrinking video game retailer should cap the frivolities off by cozying up to cryptocurrencies. Last week, GameStop apparently joined Flexa, a payment network that lets you pay for real-world stuff with blockchain assets, including the meme currency Dogecoin. “Enter the metaverse,” Flexa wrote on December 16 in an announcement that had nothing to do with the “metaverse.” “GameStop is now on Flexa, and we’re celebrating by enabling support for four new metaverse assets: Axie Infinity Shard, MANA, SAND, and Smooth Love Potion are now accepted anywhere on the Flexa network.” window.adTech.cmd.push( function() { window.adTech.googletag.display( [ 'ad-slot_1_1_mrec-mobile' ] ); } ); Flexa is an app that connects stores and restaurants with crypto-enthusiasts so that the latter can spend their Bitcoin and other environment-destroying currencies for goods and services in the real world. One of those stores now appears to be GameStop, which will apparently let you pre-order games like Pokémon Legends: Arceus using Smooth Love Potions which are currently worth $US0.03071 each. window.adTech.cmd.push( function() { window.adTech.googletag.display( [ 'ad-slot_1_1_hpu-mrec-mobile' ] ); } ); GameStop did not immediately respond to a request for comment. Cryptocurrencies have been breeding like rabbits this year, but few have become as popular, or showcased the absurdity of the entire enterprise so well, as Dogecoin. A joke inspired by the decade-old Doge meme and hatched by two software engineers back in 2013, the meme-crypto shot up to $US0.71 ($1) earlier this year thanks to Elon Musk’s tweets. Despite plummeting in the months since, the value still bounces around wildly, and one of its creators is on the record calling cryptocurrency a “right-wing, hyper-capitalist” scam. Unlike Dogecoin, GameStop’s stock has, despite some recent bumps, continued to coast at a once unthinkable $US150 ($208) a share. Of course, that hasn’t actually translated into better working conditions at the company, where employees are at the breaking point thanks in part to understaffing and terrible pay. It’s unclear how the new crypto collaboration will help them, but GameStop customers at least can now rest easy knowing it’s easier than ever to liquidate their Dogecoin holdings by pouring it all into Funko Pops. The post Meme Stock GameStop Now Accepts Meme Cryptos Like Doge appeared first on Kotaku Australia.","pubDate":"2021-12-22 18:20:00","full_description":null,"image_url":"https://imgix.kotaku.com.au/content/uploads/sites/3/2021/12/23/10d2f60dfe47c154f2ee2729cffcaefd.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280","source_id":"kotaku"},{"title":"El Salvador President Nayib Bukele's latest bitcoin purchase channels meme energy with magic number","link":"https://markets.businessinsider.com/news/currencies/el-salvador-president-nayib-bukele-bitcoin-purchase-channels-meme-energy-2021-12","keywords":null,"creator":null,"video_url":null,"description":"In a series of tweets — all pointing to the number 21 — President Nayib Bukele documented the country's purchase of 21 bitcoin.","content":null,"pubDate":"2021-12-22 17:02:25","full_description":null,"image_url":"https://i.insider.com/61c34c767b46dc0011e53ab8?format=jpeg","source_id":"businessinsider_us"}],"nextPage":1}